* Table Tests

** Straight column copy test
|  a   |  b   |   c    |
|------+------+--------|
| 0.58 | 0.58 | PASSED |
| 0.61 | 0.61 | PASSED |
| 0.76 | 0.76 | PASSED |
| 0.79 | 0.79 | PASSED |
#+TBLFM:$1=rand();%.2f::$2=$1::$3=passed($1==$2,$3)

** Relative column copy test
|  a   |  b   |   c    |
|------+------+--------|
| 0.08 | 0.08 | PASSED |
| 0.39 | 0.39 | PASSED |
| 0.92 | 0.92 | PASSED |
| 0.78 | 0.78 | PASSED |
#+TBLFM:$1=rand();%.2f::$2=$-1::$3=passed($-2 == $-1)

** Simple Boolean Comparisons
| a | b |      |   c   |   d    |
|---+---+------+-------+--------|
| 1 | 2 | a>b  | False | PASSED |
| 1 | 2 | a<b  | True  | PASSED |
| 2 | 1 | a>b  | True  | PASSED |
| 2 | 1 | a<b  | False | PASSED |
| 1 | 2 | a<=b | True  | PASSED |
| 1 | 2 | a>=b | False | PASSED |
| 1 | 2 | a==b | False | PASSED |
| 2 | 1 | a<=b | False | PASSED |
| 2 | 1 | a>=b | True  | PASSED |
| 1 | 1 | a==b | True  | PASSED |
#+TBLFM:@2$4=$1>$2::@2$5=passed($4==False)::@3$4=$1<$2::@3$5=passed(bool($4)==True)::@4$4=$-3>$-2::@4$5=passed($-1==True)::@5$4=$-3<$-2::@5$5=passed($-1==False)::@6$4=$1<=$2::@6$5=passed($-1)::@7$4=$1>=$2::@8$4=$1==$2::@7$5=passed($-1==False)::@8$5=passed($-1==False)::@9$4=$1<=$2::@9$5=passed($-1==False)::@10$4=$1>=$2::@11$4=$1==$2::@10$5=passed($-1==True)::@11$5=passed($-1==True)


** Add Sub
| s1 | s2 | desc | result |   ok   |
|----+----+------+--------+--------|
|  1 |  2 | a+b  |      3 | PASSED |
|  2 |  1 | a-b  |      1 | PASSED |
| -1 |  2 | -a+b |      1 | PASSED |
|  2 |  3 | a-b  |     -1 | PASSED |
#+TBLFM:@2$4=$1+$2::@2$5=passed($-1==3)::@3$4=$1-$2::@3$5=passed($-1==1)::@4$4=$1+$2::@4$5=passed($-1==1)::@5$4=$1-$2::@5$5=passed($-1==-1)

** Mult Div
| s1 | s2 | desc | result |   ok   |
|----+----+------+--------+--------|
| 10 |  5 | a*b  |     50 | PASSED |
| 10 |  5 | a/b  |    2.0 | PASSED |
|  2 |  5 | a**b |     32 | PASSED |
| 10 |  3 | a%b  |      1 | PASSED |
#+TBLFM:@2$4=$1*$2::@2$5=passed($-1==50)::@3$4=$1/$2::@3$5=passed(int($-1)==2)::@4$4=$1**$2::@4$5=passed($-1==32)::@5$4=$1%$2::@5$5=passed($-1==1)

** Bool Ops
|   s1  |   s2  |  desc  | result |   ok   |
|-------+-------+--------+--------+--------|
| True  |       | not a  | False  | PASSED |
| False |       | not a  | True   | PASSED |
| True  | False | a != b | True   | PASSED |
| True  | True  | a != b | False  | PASSED |
| True  | False | a == b | False  | PASSED |
| True  | True  | a == b | True   | PASSED |
#+TBLFM:@2$4=not $1::@2$5=passed($-1==False)::@3$4=not $1::@3$5=passed($-1==True)::@4$4=$1!=$2::@4$5=passed($-1==True)::@5$4=$1!=$2::@5$5=passed($-1==False)::@6$4=$1==$2::@6$5=passed($-1==False)::@7$4=$1==$2::@8$5=passed($-1==True)

** Highlighting Cells
| a  | b  | c  | e  | f  |
|----+----+----+----+----|
| r  | r  | r  | r  | r  |
| g  | g  | g  | g  | g  |
| b  | b  | b  | b  | b  |
| y  | y  | y  | y  | y  |
| c  | c  | c  | c  | c  |
| p  | p  | p  | p  | p  |
| o  | o  | o  | o  | o  |
| pi | pi | pi | pi | pi |
#+TBLFM:@2=highlight(@<,"red","r")::@3=highlight(@3,"green","g")::@4=highlight(@4,"blue","b")::@5=highlight(@5,"yellow","y")::@6=highlight(@6,"cyan","c")::@7=highlight(@7,"purple","p")::@8=highlight(@8,"orange","o")::@9=highlight(@9,"pink","pi")

** Basic Functions
| source 1 | source 2 |    desc   | result |   ok   |
|----------+----------+-----------+--------+--------|
| -1       |          | abs       | 1      | PASSED |
| 1.1      |          | ceil      | 2      | PASSED |
| 1.1      |          | floor     | 1      | PASSED |
| 1.1      |          | int       | 1      | PASSED |
| 0        |          | bool      | False  | PASSED |
| 1        |          | float     | 1.0    | PASSED |
| 1.5      |          | round     | 2.0    | PASSED |
| 1.9      |          | trunc     | 1      | PASSED |
| 2*pi     |          | sin(2*pi) | -0.0   | PASSED |
| 0        |          | cos(0)    | 1.0    | PASSED |
| pi       |          | tan(pi)   | -0.0   | PASSED |
|          |          | exp(2)    | 7.39   | PASSED |
#+TBLFM:@2$4=abs($1)::@2$5=passed($-1==1)::@3$4=ceil($1)::@3$5=passed($-1==2)::@4$4=floor($1)::@4$5=passed($-1==1)::@5$4=int($1)::@5$5=passed($-1==1)::@6$4=bool($1)::@6$5=passed($-1==False)::@7$4=float($1)::@7$5=passed($-1==1.0)::@8$4=round($1)::@8$5=passed($-1==2.0)::@9$4=trunc($1)::@9$5=passed($-1==1)::@10$4=round(sin(2*pi))::@10$5=passed($-1==0)::@11$4=cos(0)::@11$5=passed($-1==1.0)::@12$4=round(tan(pi))::@12$5=passed($-1==0)::@13$4=exp(2);%.2f::@13$5=passed($-1==7.39)


** DateTime Functions
#+NAME: date-time-test
|           s1           | s2 |   desc   |         result         |   ok   |
|------------------------+----+----------+------------------------+--------|
| <2021-03-15 Mon 17:57> |    | now      | <2021-03-15 Mon 18:19> | PASSED |
|                        |    | minute   | 57                     | PASSED |
|                        |    | hour     | 17                     | PASSED |
|                        |    | day      | 15                     | PASSED |
|                        |    | year     | 2021                   | PASSED |
|                        |    | month    | 3                      | PASSED |
|                        |    | time     | 17:57:00               | PASSED |
|                        |    | date     | <2021-03-15 Mon 17:57> | PASSED |
| <2021-03-16 Tue 17:57> |    | weekday  | 1                      | PASSED |
|                        |    | yearday  | 75                     | PASSED |
| 3d                     |    | duration | 3d                     | PASSED |
#+TBLFM:@2$4=now()::@2$5=passed(minute(date($-1))==minute(now()))::@3$4=minute(date(@2$1))::@3$5=passed($-1==57)::@4$4=hour(@2$1)::@4$5=passed($-1==17)::@5$4=day(@2$1)::@5$5=passed($-1==15)::@6$4=year(@2$1)::@6$5=passed($-1==2021)::@7$4=month(@2$1)::@7$5=passed($-1==3)::@8$4=time(@2$1)::@9$4=date(@2$1)::@9$5=passed($-1==@2$1)::@10$4=weekday(date(@10$1))::@11$4=yearday(@10$1)::@11$5=passed($-1==75)::@10$5=passed($-1==1)::@8$5=passed($-1=="17:57:00")::@12$4=duration(@12$1)::@12$5=passed($-1=="3d")

** Range Functions
| a | b | c | d | e |   desc   | result |   ok   |
|---+---+---+---+---+----------+--------+--------|
| 1 | 2 | 3 | 4 | 5 | vsum row | 15     | PASSED |
| 2 |   |   |   |   | vsum col | 15     | PASSED |
| 3 |   |   |   |   | vmean    | 3.0    | PASSED |
| 4 |   |   |   |   | vmax     | 5      | PASSED |
| 5 |   |   |   |   | vmin     | 1      | PASSED |
|   |   |   |   |   | vmedian  | <ERR>  | FAILED |
#+TBLFM:@2$7=vsum($1..$5)::@2$8=passed($-1==15)::@3$7=vsum(@2$1..@6$1)::@3$8=passed($-1==15)::@4$7=vmean(@2$1..@2$5)::@4$8=passed($-1==3.0)::@5$7=vmax(@2$1..@2$5)::@5$8=passed($-1==5)::@6$7=vmin(@2$1..@2$5)::@6$8=passed($-1==1)::@7$7=vmedian(@2$1..@2$5)::@7$8=passed($-1==3)

** Remote References
Extract a result from somewhere else and use it in this table.
|         result         |   ok   |
|------------------------+--------|
| <2021-03-15 Mon 17:57> | PASSED |
#+TBLFM:@2$1=remote("date-time-test",@2$1)::@2$2=passed(minute($-1)==57)


** TODO Side Relative References
** TODO Range Source and Targets
** TODO Advanced Table Syntax
** TODO Large Tables 
** TODO Basic Plotting